#+TITLE: ~/.emacs.d/init.org
** Run babel-tangle on file-save

Originally from [[http://emacs.stackexchange.com/questions/20707/automatically-tangle-org-files-in-a-specific-directory][StackOverflow]]

#+begin_src emacs-lisp :tangle ~/dotfiles/emacs.d/init.el
(defun my/tangle-dotfiles ()
  "If the current file is in '~/.dotfiles', the code blocks are tangled"
  (when (equal (file-name-directory (directory-file-name buffer-file-name))
               (concat (getenv "HOME") "/dotfiles/emacs.d/"))
    (org-babel-tangle)
    (message "%s tangled" buffer-file-name)))

(add-hook 'after-save-hook #'my/tangle-dotfiles)
#+end_src

#+RESULTS:
| alchemist-hooks-compile-on-save | alchemist-hooks-test-on-save | sml/generate-buffer-identification | my/tangle-dotfiles |

** Capture Templates
#+begin_src emacs-lisp  :tangle ~/dotfiles/emacs.d/init.el
(setq org-capture-templates
      '(("t" "Todo (any)" entry (file+headline "~/Dropbox/todo/todo.org" "Captured")
             "* TODO %?\n  Captured: %U\n  %a")
        ("r" "Read/Research" entry (file+headline "~/Dropbox/todo/todo.org" "Read")
             "* READ %?\n  Captured: %U\n  %a")
      )
)
#+end_src

#+RESULTS:
| t | Todo (any)    | entry | (file+headline ~/Dropbox/todo/todo.org Captured) | * TODO %?\n  Captured: %U\n  %a |
| r | Read/Research | entry | (file+headline ~/Dropbox/todo/todo.org Read)     | * READ %?\n  Captured: %U\n  %a |

* Recentf
#+begin_src emacs-lisp :tangle ~/dotfiles/emacs.d/init.el
(setq recentf-max-saved-items 50)
(run-at-time (current-time) 300 'recentf-save-list)
#+end_src

#+RESULTS:
: [nil 22715 30756 10774 300 recentf-save-list nil nil 0]

* javascript mode
#+begin_src emacs-lisp :tangle ~/dotfiles/emacs.d/init.el
(setq js-indent-level 2)
#+end_src

#+RESULTS:
: 2

* css/scss mode
#+begin_src emacs-lisp :tangle ~/dotfiles/emacs.d/init.el
(setq css-indent-offset 2)
#+end_src

#+RESULTS:
: 2

